# running in vac/src/
read_verilog -sv vac_dut.sv
prep -top top

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
